Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
Compares two deformed shape settings objects.
other:
Deformed shape settings object to compare with.
Returns:
True if objects are equal, false otherwise.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Transparency
Transparency percentage of deformed shape color fill on surfaces
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: transparency is less than 0 or greater than 100
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridLineWeight
Line weight of grid lines.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridColor
Color of grid lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.Rounding
Increment to which numeric values of analysis results are rounded in deformed shape.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: rounding is not positive
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextLabelType
Type of deformed shape text visualization.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowContourLines
If true, show contour lines in the analysis display.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.ShowGridLines
If true, show grid lines in the analysis display.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor
Constructs a default instance of deformed shape settings.
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings
Contains deformed shape settings for analysis display style element.
Since:
2013